[
    {
        "full_text": "It's Jan 1st and ya girl is committing to another 100 Days Challenge 💀🥳\n\nJoin us in Atlantis for 100 Days of User Experience! We learn together. 🥰\n\nAnyone doing a 100 Days challenge, or daily venture stand-ups are welcome, too. 🔥\n\nhttps://t.co/Sf3YtPuhq9",
        "created_at": "Sat Jan 01 09:11:30 +0000 2022",
        "id": "1477205833897308161",
        "media": false
    },
    {
        "full_text": "'Technologists are not noted for learning from the errors of the past. They look forward, not behind, so they repeat the same problems over and over again.' \n- Donald Norman\n\nI wonder how many hard pills to swallow there will be throughout this journey. 🥰\n\n1/100 Days of UX",
        "created_at": "Sat Jan 01 10:42:06 +0000 2022",
        "id": "1477228633437585408",
        "media": false
    },
    {
        "full_text": "It's refreshing considering user needs from a people-first design perspective (no dark patterns). Value propositions and business needs can suck it for a while.\n\nI can't decide whether this diagram is enlightening or confusing or both, though💀\n\n2/100 Days of UX https://t.co/YUpbKpbTeX",
        "created_at": "Sun Jan 02 12:48:06 +0000 2022",
        "id": "1477622730350489603",
        "media": "https://t.co/YUpbKpbTeX"
    },
    {
        "full_text": "Moved to an updated version of the same course and hot damn, are there differences. Kinda like it tho??\n\nLike now it's prefacing everything with  'We think it’s counterproductive to try to find the authoritative definition - \n\n3/100 Days of UX",
        "created_at": "Mon Jan 03 17:04:24 +0000 2022",
        "id": "1478049616880750594",
        "media": false
    },
    {
        "full_text": "Well, that didn't last long. Business needs are already back, dammit! 🤣💀\n\nWas hoping for a bit more about the impact of UX on people regardless of what their non-design roles are, but I'll write about that myself later :3\n\n4/100 Days of UX https://t.co/b5SHDGY6mZ https://t.co/fAOyJ25uph",
        "created_at": "Tue Jan 04 11:00:34 +0000 2022",
        "id": "1478320443434012674",
        "media": "https://t.co/fAOyJ25uph"
    },
    {
        "full_text": "I thought 'Mind the gap' (haha, can you hear it?) was just a general London Underground warning, but it started because the gaps between trains and platforms could be especially large when the platforms were curved 💀\n\nBut why were they curved??\n\n5/100 Days of UX",
        "created_at": "Wed Jan 05 07:40:26 +0000 2022",
        "id": "1478632468013932547",
        "media": false
    },
    {
        "full_text": "Different types of empathy include:\n\n- Cognitive\n- Affective/emotional\n- Somatic\n\nCognitive is the one we generally employ in design, used to understand other perspectives. It's quite different from affective empathy, which is about responding with emotion.\n\n6/100 Days of UX",
        "created_at": "Thu Jan 06 04:36:13 +0000 2022",
        "id": "1478948494983368706",
        "media": false
    },
    {
        "full_text": "Intentionally good usability feels like an extension of being kind to people through design.\n\n7/100 Days of UX",
        "created_at": "Fri Jan 07 10:49:00 +0000 2022",
        "id": "1479404695814737922",
        "media": false
    },
    {
        "full_text": "Dehumanising users is a scary thought, tbh. But apparently it happens.\n\nGonna have to do more digging.\n\n8/100 Days of UX",
        "created_at": "Sat Jan 08 10:47:50 +0000 2022",
        "id": "1479766793329643520",
        "media": false
    },
    {
        "full_text": "People forget User Experience isn't limited to technology. It's all-encompassing and affects every part of our lives. \n\nUX doesn't start and stop with the products we use.\n\n9/100 Days of UX",
        "created_at": "Sun Jan 09 15:58:59 +0000 2022",
        "id": "1480207483465461762",
        "media": false
    },
    {
        "full_text": "The idea that having a poor solution means the problem's been poorly defined resonates with me as a design concept.\n\nIt's applied heavily to the way I learnt entrepreneurship and I love how design's informed a lot of perspectives in different disciplines.\n\n10/100 Days of UX",
        "created_at": "Mon Jan 10 17:26:37 +0000 2022",
        "id": "1480591923064705025",
        "media": false
    },
    {
        "full_text": "@alegarciy HAHAHAHAHA.\n\nI put 100 days of code instead of UX oops :P",
        "created_at": "Tue Jan 11 19:26:56 +0000 2022",
        "id": "1480984591598899200",
        "media": false
    },
    {
        "full_text": "Apparently a ton of projects are poorly prepared for because the user needs and business objectives aren't specified properly in the first place - and that affects all the other planes of user experience as a result.\n\ngg no re\n\n12/100 Days of UX",
        "created_at": "Wed Jan 12 16:10:23 +0000 2022",
        "id": "1481297515840679937",
        "media": false
    },
    {
        "full_text": "And we thought the last diagram was a clusterfuck.\n\nNot a wonder it can be difficult to identify the root cause(s) of some UX problems xD But can get there.\n\n13/100 Days of UX https://t.co/b5SHDHgfB7 https://t.co/ijRr2oluo3",
        "created_at": "Thu Jan 13 21:01:17 +0000 2022",
        "id": "1481733112027844609",
        "media": "https://t.co/ijRr2oluo3"
    },
    {
        "full_text": "Turns out my general research process (honed mostly through experience) for the strategy stage of UX is something I already do for my projects and ventures. This was more validating than I thought it'd be :')\n\n14/100 Days of UX",
        "created_at": "Fri Jan 14 19:57:08 +0000 2022",
        "id": "1482079354280878081",
        "media": false
    },
    {
        "full_text": "Initial stakeholder q's include: what the product accomplishes, the userbase, how the project fits within the business strategy, how it's differentiated, tech decisions made, value prop for this product, and value props for competitors, user complaints\n\n15/100 Days of UX",
        "created_at": "Sat Jan 15 20:09:14 +0000 2022",
        "id": "1482444786812727297",
        "media": false
    },
    {
        "full_text": "Learnt a bit more about B2B user research q's. Honestly, it's not that different to my standard questions for *anyone*.\n\nThe context in which a user uses a product is important regardless of whether you're selling to the business or not.\n\n16/100 Days of UX",
        "created_at": "Sun Jan 16 14:10:30 +0000 2022",
        "id": "1482716895812132867",
        "media": false
    },
    {
        "full_text": "Talking to everyone is paramount. We must do so in order to align everyone to what's worth doing, what we're creating, and the value it provides. \n\nI don't see devs weighing feasibility/viablity against importance as much as they should.\n\n17/100 Days of UX",
        "created_at": "Mon Jan 17 11:16:28 +0000 2022",
        "id": "1483035489422942210",
        "media": false
    },
    {
        "full_text": "It's interesting hearing critique about agile/lean models,  with dislike for little/poor documentation; this is likely more about management rather than methodology, and can be rectified.\n\nDocumentation should still align and scope appropriately. It must exist.\n\n18/100 Days of UX",
        "created_at": "Tue Jan 18 08:29:31 +0000 2022",
        "id": "1483355862932819975",
        "media": false
    },
    {
        "full_text": "I have a special appreciation for continuous delivery being considered during the scoping state. A lot of people treat it as an expectation, particularly with software in the early stages, but don't plan how it'll be accommodated before starting to build.\n\n19/100 Days of UX",
        "created_at": "Wed Jan 19 10:35:21 +0000 2022",
        "id": "1483749915809714177",
        "media": false
    },
    {
        "full_text": "There are things people:\n🗨️ say they need\n✨ actually need\n🧠 don't know they need\n\nThese may be wildly different, and don't make into functional specs due to false predictions, addressing symptoms instead of a root problem, and minimal problem exploration.\n\n20/100 Days of UX",
        "created_at": "Thu Jan 20 11:51:52 +0000 2022",
        "id": "1484131558718320646",
        "media": false
    },
    {
        "full_text": "Framing functional specs positively and specifically can impact implementation and the subsequent UX.\n\ni.e. The system will...\n\n...deny the user purchasing a side without a main meal ☠️\n\nvs \n\n...suggest main meals if the user tries to purchase a side solo✨\n\n21/100 Days of UX",
        "created_at": "Fri Jan 21 11:40:45 +0000 2022",
        "id": "1484491151843344388",
        "media": false
    },
    {
        "full_text": "Content strategy and scoping often gets ignored in many project discussions I've participated in. Validating content against a project's strategic objectives, what?\n\nAt least I'll be armed with a better set of q's and prep for planning now.\n\n22/100 Days of UX",
        "created_at": "Sat Jan 22 14:00:20 +0000 2022",
        "id": "1484888664647901190",
        "media": false
    },
    {
        "full_text": "Defining the scope ahead of time (content, functional specs, reqs, etc) forces everyone to acknowledge and address potential conflicts and rough spots before building.\n\nThat thing about good planning saving time + effort coding needlessly? Same deal.\n\n23/100 Days of UX",
        "created_at": "Sun Jan 23 09:09:36 +0000 2022",
        "id": "1485177889415135234",
        "media": false
    },
    {
        "full_text": "Intuitive [access to content] means 'single trial learning'. It doesn't mean automatic recognition and understanding of how to use what's on a screen.\n\nIt means we do it once and we remember it forever.\n\nSingle trial learning.\n\n24/100 Days of UX",
        "created_at": "Mon Jan 24 11:02:55 +0000 2022",
        "id": "1485568795238633474",
        "media": false
    },
    {
        "full_text": "Intuitive interfaces are intuitive because they leverage a user's previous experience - at present, with a current product/situation, and with other products elsewhere.\n\n25/100 Days of UX",
        "created_at": "Tue Jan 25 15:44:09 +0000 2022",
        "id": "1486001957857013760",
        "media": false
    },
    {
        "full_text": "Apparently we're still in the infancy of using touch screens; gestures are all over the place as a result.\n\nAnd both designers and devs regularly fuck up by including way too many.\n\n26/100 Days of UX",
        "created_at": "Wed Jan 26 12:43:02 +0000 2022",
        "id": "1486318763398266882",
        "media": false
    },
    {
        "full_text": "It's not information overload. It's filter failure' - Clay Shirky\n\nThe amount of information we've access to is ever-increasing. Our filters have to get smarter to keep in line with our capacity to process, as that's not changing any time soon.\n\n27/100 Days of UX",
        "created_at": "Thu Jan 27 13:14:32 +0000 2022",
        "id": "1486689078791716865",
        "media": false
    },
    {
        "full_text": "If there's one thing I'd appreciate some people taking on board, it's the concept of economising when it comes to surface-level visual elements; the most important should be easily perceived, and the rest de-emphasised.\n\nThere's often too much cramming :')\n\n28/100 Days of UX",
        "created_at": "Fri Jan 28 12:49:40 +0000 2022",
        "id": "1487045207535218689",
        "media": false
    },
    {
        "full_text": "The most important basic principles to organise visual information are:\n\n&gt; Alignment\n&gt; Proximity\n&gt; Repetition\n&gt; Contrast\n\nUnsure if I fully agree with this list, but more on that later.\n\n29/100 Days of UX",
        "created_at": "Sat Jan 29 18:23:42 +0000 2022",
        "id": "1487491657352507393",
        "media": false
    },
    {
        "full_text": "TURNS OUT those eye-tracking heat maps cover foveal vision and not peripheral; apparently that's a 2%/98% split respectively. Soooo they shouldn't be relied upon too much, if at all.\n\nI'll be back if I can find relevant studies. xD\n\n30/100 Days of UX",
        "created_at": "Sun Jan 30 20:04:20 +0000 2022",
        "id": "1487879372522463233",
        "media": false
    },
    {
        "full_text": "The same products can have the best usability and worst at the same time depending on the users they're built for.\n\nAudience matters.\n\n31/100 Days of UX",
        "created_at": "Mon Jan 31 18:35:17 +0000 2022",
        "id": "1488219349630423040",
        "media": false
    },
    {
        "full_text": "There's just so much in common between entrepreneurship and design that *good* designers are likely capable of being better at it than a lot of people - particularly at the ideation/founding stage. 💀\n\n32/100 Days of UX",
        "created_at": "Tue Feb 01 12:19:09 +0000 2022",
        "id": "1488487080275881984",
        "media": false
    },
    {
        "full_text": "6 rules of usability:\n- The design is based on an explicit understanding of users, tasks, and environments\n- Users are involved throughout design and development\n- The design is driven and refined by user-centred evaluation\n- The process..\n\n33/100 Days of UX",
        "created_at": "Wed Feb 02 17:55:09 +0000 2022",
        "id": "1488934027977322501",
        "media": false
    },
    {
        "full_text": "The first rule of finding out what people want is:\n\nDon't ask people what they want. \n\n🤣 It's true though. I've said it plenty. Starting off interviews this way is absolutely *terrible*.\n\n34/100 Days of UX",
        "created_at": "Thu Feb 03 13:25:08 +0000 2022",
        "id": "1489228463060176896",
        "media": false
    },
    {
        "full_text": "Users don't care about your product - or any, really.\n\nThey care about getting the job done.\n\n35/100 Days of UX",
        "created_at": "Fri Feb 04 17:53:35 +0000 2022",
        "id": "1489658406944505857",
        "media": false
    },
    {
        "full_text": "On contextual inquiry - the best observations are things we see/hear - not interpretations; things people say, a goal, an action, struggle, etc.\n\n36/100 Days of UX",
        "created_at": "Sat Feb 05 18:28:04 +0000 2022",
        "id": "1490029472774758400",
        "media": false
    },
    {
        "full_text": "I didn't realise there are people who actually speak with non-users of a system (e.g. managers about other employees, when the product is not for them) and ignore the target audience COMPLETELY like what xD\n\n37/100 Days of UX",
        "created_at": "Sun Feb 06 15:40:16 +0000 2022",
        "id": "1490349631309434881",
        "media": false
    },
    {
        "full_text": "Do you have any favourite affinity diagrams? Such as:\n\n- User journey maps\n- Empathy maps\n- Storyboards\n- Personas\n- Red routes\n- Others?\n\nWhy? Is there a frequented context for you?\n\n38/100 Days of UX",
        "created_at": "Mon Feb 07 10:18:58 +0000 2022",
        "id": "1490631161441587205",
        "media": false
    },
    {
        "full_text": "Myths about field visits:\n\n1. Finding out user needs through surveys and focus groups; focus on actual behaviour instead of responses.\n\n2. A user researcher's job is to learn about users. Not quite. They're meant to help the team learn about users.\n\n3. ...\n\n39/100 Days of UX",
        "created_at": "Tue Feb 08 16:47:41 +0000 2022",
        "id": "1491091374380560386",
        "media": false
    },
    {
        "full_text": "The average person doesn't exist. Nor does the average user/customer. Combined stats pointing to 'average' don't make up any kind of actual person.\n\nPersonas can be useful, but apparently many people do them improperly so a lot of the time they're useless 🙃\n\n40/100 Days of UX",
        "created_at": "Wed Feb 09 10:52:36 +0000 2022",
        "id": "1491364401727049733",
        "media": false
    },
    {
        "full_text": "Market research confirms users want something.\n\nUser research determines how users want that something to work.\n\n^ As a result, the final user groups from the two can have differences.\n\n41/100 Days of UX",
        "created_at": "Thu Feb 10 11:54:00 +0000 2022",
        "id": "1491742241052065793",
        "media": false
    },
    {
        "full_text": "The real value of personas is in the process -not the persona documents we're left with.\n\nAlso, it seems that assumption vs realistic personas is very much a thing and likely where the 'uselessness' of personas stems from. Demographics are rarely important.\n\n42/100 Days of UX",
        "created_at": "Fri Feb 11 11:48:25 +0000 2022",
        "id": "1492103226518548480",
        "media": false
    },
    {
        "full_text": "Red routes are critical paths users take to execute their tasks and accomplish their goals. They need to be frequented, critical, a series of actions, drive business/product metrics, built for scale, and consist of the majority of product traffic.\n\n43/100 Days of UX",
        "created_at": "Sat Feb 12 15:56:12 +0000 2022",
        "id": "1492527969105248258",
        "media": false
    },
    {
        "full_text": "Information is more than the sum of its parts; the way it's organised tells us something.\n\n44/100 Days of UX",
        "created_at": "Sun Feb 13 12:48:37 +0000 2022",
        "id": "1492843151660568580",
        "media": false
    },
    {
        "full_text": "Something I don't see devs do much is have users organise the content. Card sorting is fairly useful for this and can be done with a handful of people simultaneously.\n\nIt's good to understand directly from their perspective sometimes.\n\n45/100 Days of UX",
        "created_at": "Mon Feb 14 14:49:41 +0000 2022",
        "id": "1493236008053522434",
        "media": false
    },
    {
        "full_text": "Trigger words affect the success rate of completing goals. They need to be words familiar to users. Often things are presented in an organisation-centred manner i.e. 'Support this [org]' vs 'Buy some bird food'.\n\nResearch. Consider appropriately.\n\n46/100 Days of UX",
        "created_at": "Tue Feb 15 12:39:51 +0000 2022",
        "id": "1493565719120064518",
        "media": false
    },
    {
        "full_text": "A note, as they often get mixed up -\n\nAffordances: properties of an object that suggest how an object can be interacted with.\n\nSignifiers: indicate how something is designed to be interacted with to get an intended result.\n\nIf you wanna sound highly accurate -\n\n47/100 Days of UX",
        "created_at": "Wed Feb 16 16:14:56 +0000 2022",
        "id": "1493982237515448322",
        "media": false
    },
    {
        "full_text": "Ngl, a design pattern called 'wizards and tunnels' makes me feel like I'm playing some fantasy game. TTRPG probs.\n\nDesign patterns are fucking great when they fit a user's mental model; mine might be a tad warped though. 💀\n\n48/100 Days of UX",
        "created_at": "Thu Feb 17 17:48:07 +0000 2022",
        "id": "1494368074396758018",
        "media": false
    },
    {
        "full_text": "I have a strange affinity towards the progressive disclosure design pattern on a personal level. Maybe I just like reduction of clutter but still having access to things :3\n\n49/100 Days of UX",
        "created_at": "Fri Feb 18 14:42:43 +0000 2022",
        "id": "1494683802895282182",
        "media": false
    },
    {
        "full_text": "Drop down menus: incredibly flexible and used in all sorts of ways\n\nAlso drop down menus: use as a last resort 💀\n\n50/100 Days of UX",
        "created_at": "Sat Feb 19 10:20:10 +0000 2022",
        "id": "1494980117701214209",
        "media": false
    },
    {
        "full_text": "So there's this when looking at the aesthetic usability effect -\n\n[C]ontrast\n[A]lignment\n[R]epetition\n[P]roximity\n\nand my brain is just like... Why didn't ya just bite the bullet and call it CRAP 💀\n\n51/100 Days of UX",
        "created_at": "Sun Feb 20 12:30:06 +0000 2022",
        "id": "1495375206818664451",
        "media": false
    },
    {
        "full_text": "'In most projects, the first system build is barely usable. The only question is whether to plan in advance to build a throwaway or promise to deliver the throwaway to customers.' - Frederick Brooks\n\nEvolutionary prototypes are a thing but lol 💀💀💀\n\n52/100 Days of UX",
        "created_at": "Mon Feb 21 13:29:10 +0000 2022",
        "id": "1495752458316189699",
        "media": false
    },
    {
        "full_text": "Wireframing is not the same as paper prototypes. Nope, not even if you're using sketch-styled UI elements 🤣\n\nThey should be quick, rough, and highly interactive.\n\nAnd no, you don't have to make it super fucking neat no matter what your professor says 💀\n\n53/100 Days of UX",
        "created_at": "Tue Feb 22 12:56:38 +0000 2022",
        "id": "1496106659772760066",
        "media": false
    },
    {
        "full_text": "Ultimately small bets allow you to fail fast so you can win bigger.\n\n- on paper prototyping and testing them with users\n\n54/100 Days of UX",
        "created_at": "Wed Feb 23 10:32:29 +0000 2022",
        "id": "1496432770733985792",
        "media": false
    },
    {
        "full_text": "No matter how much people try to differentiate themselves, usability evaluations will still fall under one of two distinct types:\n\n&gt; Usability inspection\nor\n&gt; Usability test\n\nHave to test with our users.\n\n55/100 Days of UX https://t.co/PKoI78pS7F",
        "created_at": "Thu Feb 24 14:38:28 +0000 2022",
        "id": "1496857064093921281",
        "media": "https://t.co/PKoI78pS7F"
    },
    {
        "full_text": "'This might make sense if you're an engineer. It doesn't really make sense to a human being'.\n\nFucking laughed out loud at that one xD\n\nApparently testing with 5 people early on highlights the majority of big issues.\n\n56/100 Days of UX",
        "created_at": "Fri Feb 25 13:02:59 +0000 2022",
        "id": "1497195421256806402",
        "media": false
    },
    {
        "full_text": "I was gonna write some stuff about heuristics... But y'know what. I'm just going to acknowledge and celebrate that I finished my second UX course on Udemy and completed sections 1 and 2 of 16 in a third :3\n\nOnce I've finished it I can focus on heavy theory.\n\n57/100 Days of UX",
        "created_at": "Sat Feb 26 08:03:31 +0000 2022",
        "id": "1497482446857990146",
        "media": false
    },
    {
        "full_text": "Looking at the UX Value Loop and I see this:\n\nWhat are primary differences between your business model and theirs (competitors)?\n\nSuch fucking huge overlaps between UX and entrepreneurship 🙃HCI and S. Eng as well.\n\n58/100 Days of UX",
        "created_at": "Sun Feb 27 10:19:10 +0000 2022",
        "id": "1497878969529823237",
        "media": false
    },
    {
        "full_text": "Information architecture navigational models:\n\n&gt; Hierarchy\n&gt; Hub and spoke\n&gt; Bento box/dashboard\n&gt; Nested list\n&gt; Filtered view\n&gt; Combo\n\nIs that it? 🙃 Certainly feels like there's at least double that with the volume out on the net, tbh.\n\n59/100 Days of UX",
        "created_at": "Mon Feb 28 10:30:37 +0000 2022",
        "id": "1498244241415630852",
        "media": false
    },
    {
        "full_text": "One common assumption orgs/clients make is that people start their journey on a website's homepage. Rarely true, especially with the way Google works.\n\nI mention that because we had data to show this at work too :D\n\n60/100 Days of UX",
        "created_at": "Tue Mar 01 01:02:24 +0000 2022",
        "id": "1498463630060552194",
        "media": false
    },
    {
        "full_text": "Do not seek to follow in the footsteps of the wise.\nSeek what they sought.\n- Matsuo Basho\n\nI wish more people understood this. Success stories teach little about the journey to success; they rarely centre that pathway in context of nuanced struggle.\n\n61/100 Days of UX",
        "created_at": "Wed Mar 02 12:31:55 +0000 2022",
        "id": "1498999540380483587",
        "media": false
    },
    {
        "full_text": "'Our habitual reflexive associations are stronger than any clever design device will ever be.'\n\nHard to defeat them. Usually.\n\n62/100 Days of UX",
        "created_at": "Thu Mar 03 12:04:47 +0000 2022",
        "id": "1499355102674841601",
        "media": false
    },
    {
        "full_text": "Contrast creates information hierarchy and so should always be considered before colour.\n\nHuh. Didn't think there'd have been an order to it.\n\n63/100 Days of UX",
        "created_at": "Fri Mar 04 10:20:15 +0000 2022",
        "id": "1499691183605686274",
        "media": false
    },
    {
        "full_text": "Turns out you can turn visual paths into wireframes.\n\nI already did this but for some reason didn't frame it this explicitly? Guess it's good I'm going over the same thing multiple times from different sources!\n\n64/100 Days of UX",
        "created_at": "Sat Mar 05 11:30:17 +0000 2022",
        "id": "1500071193231392769",
        "media": false
    },
    {
        "full_text": "People 👏 don't 👏 read 👏they 👏 scan👏\n\nWe all need reminders of that from time to time - not just the people we work for or cater to.\n\nAlso: I rarely emphasise with clapping and thought this was appropriate. 💀\n\n65/100 Days of UX",
        "created_at": "Sun Mar 06 16:29:00 +0000 2022",
        "id": "1500508755951513604",
        "media": false
    },
    {
        "full_text": "5 Principles of Interaction Design:\n\n&gt; Consistency\n&gt; Visibility\n&gt; Learnability\n&gt; Predictability\n&gt; Feedback\n\nThere are many but most can be boiled down to those five. Or so they say. :3\n\n66/100 Days of UX",
        "created_at": "Mon Mar 07 14:10:19 +0000 2022",
        "id": "1500836244338921474",
        "media": false
    },
    {
        "full_text": "'A problem well stated is a problem half solved'\n- Charles Kettering\n\nAnd if it can't be, then it's either not a problem, or poorly understood. One of the few simple but significant concepts I find common to core disciplines I work within.\n\n67/100 Days of UX",
        "created_at": "Tue Mar 08 14:25:29 +0000 2022",
        "id": "1501202451114135556",
        "media": false
    },
    {
        "full_text": "Damn. This whole selling UX/UCD to companies and orgs seems to be a highly common thing. \n\nSucks that so many people are still against integrating all the good that can come from design into their products.\n\n68/100 Days of UX",
        "created_at": "Wed Mar 09 11:37:41 +0000 2022",
        "id": "1501522608340500486",
        "media": false
    },
    {
        "full_text": "So there was a figure for it - 83% is the average improvement in KPIs when it comes to ROI as a result of improving UX (particularly usability). That was 2008, so perhaps less now...?\n\nThe figure used to be 135%. Hot damn 😆\n\n69 (nice)/100 Days of UX https://t.co/Iv2j4FJ8D0",
        "created_at": "Thu Mar 10 13:37:01 +0000 2022",
        "id": "1501915028454522881",
        "media": false
    },
    {
        "full_text": "'Empathy is at the heart of design. Without the understanding of what others see, feel, and experience, design is a pointless task.' \n- Tim Brown\n\nNot just design, tbh. Tech broadly could do with more empathy, and for one another in general - not just users.\n\n70/100 Days of UX",
        "created_at": "Fri Mar 11 16:29:10 +0000 2022",
        "id": "1502320737662943239",
        "media": false
    },
    {
        "full_text": "User research is important to:\n\n&gt; Create designs that are truly relevant to users\n&gt; Create designs that are easy and pleasurable to use\n&gt; Understand the return on investment (ROI) of your UX design\n\nBasic. But yes.\n\n71/100 Days of UX",
        "created_at": "Sat Mar 12 17:41:25 +0000 2022",
        "id": "1502701308343898112",
        "media": false
    },
    {
        "full_text": "Déformation professionnelle - the tendency to look at something from the perspective of one's own expertise or profession.\n\nThat's the cognitive bias hindering us from seeing things the way most people would.\n\n72/100 Days of UX",
        "created_at": "Sun Mar 13 11:10:10 +0000 2022",
        "id": "1502965236261081095",
        "media": false
    },
    {
        "full_text": "The meaning of messaging behind design is... Mind-blowing.\n\nLiterally everything we touch and use is telling us what is/isn't okay; what's acceptable, discouraged, enticing, self-sabotaging - how to *BE*.\n\nI already knew. But the significance just sunk in.\n\n73/100 Days of UX",
        "created_at": "Mon Mar 14 10:27:25 +0000 2022",
        "id": "1503316865929867264",
        "media": false
    },
    {
        "full_text": "'You need to find ways of... enabling people in industry and academia to use methods they didn't *learn* ... make it *easier* ... to get the crucial aspects into the experience design'\n- Marc Hassenzahl\n\nThis resonated with me so hard, for two reasons:\n\n74/100 Days of UX",
        "created_at": "Tue Mar 15 04:39:11 +0000 2022",
        "id": "1503591617265299456",
        "media": false
    },
    {
        "full_text": "Onto the three levels of emotional design - visceral, behavioural, and reflective design.\n\nTheory is so fucking interesting. Kinda glad I got the practical courses out of the way!\n\nI think I really want to pursue deeper study/work in design. 💀\n\n75/100 Days of Design",
        "created_at": "Wed Mar 16 12:12:39 +0000 2022",
        "id": "1504068122919448580",
        "media": false
    },
    {
        "full_text": "Focusing on what a user generally *feels* is preferable when it comes to UX; it's apparently more common to see a focus on usability.\n\nGlad I gravitated towards the former from the beginning. Feel like I have more tools to understand how to do it, too ❤️\n\n76/100 Days of UX",
        "created_at": "Thu Mar 17 11:59:41 +0000 2022",
        "id": "1504427248417644551",
        "media": false
    },
    {
        "full_text": "'Without emotion, in many ways we don't exist fully'\n- Alan Dix\n\nAnd yet we still continually underrate, curtail, and try to minimise that part of being human.\n\nIt can be powerful - if you know how.\n\n77/100 Days of UX",
        "created_at": "Fri Mar 18 10:23:00 +0000 2022",
        "id": "1504765303901011973",
        "media": false
    },
    {
        "full_text": "Emotion in systems:\n\n&gt; Eliciting emotion: create a feeling\n&gt; Affective computing: detect and respond to emotion; modify and adapt the system to user\n&gt; Conduit for emotion: record/transmit users' emotions\n\n78/100 Days of UX",
        "created_at": "Sat Mar 19 11:45:17 +0000 2022",
        "id": "1505148399863349249",
        "media": false
    },
    {
        "full_text": "'Peak experience' is borrowed from psychology, right? The term seems to apply loosely. Many of the experiences we're designing for are *not* 'peak' - particularly if they involve high-level self-actualisation.\n\nRather mundane in comparison, at times, really🙃\n\n79/100 Days of UX",
        "created_at": "Sun Mar 20 11:34:31 +0000 2022",
        "id": "1505508076262412288",
        "media": false
    },
    {
        "full_text": "The more I learn about design thinking the more I want to suggest it as my default lazy-version response to super noob entrepreneurs asking for advice validating their ideas 😆\n\nAnyway: finished my fourth course. Onto my fifth. 🥳\n\n80/100 Days of UX",
        "created_at": "Mon Mar 21 09:11:32 +0000 2022",
        "id": "1505834482112540675",
        "media": false
    },
    {
        "full_text": "'I try not to think out of the box anymore, but on its edge, its corner, its fla, and under its bar code'\n- Clint Runge\n\nDesign thinking is both an art and a science. There's plenty of rationalisation and research going on.\n\n81/100 Days of UX",
        "created_at": "Tue Mar 22 20:19:00 +0000 2022",
        "id": "1506364843472961544",
        "media": false
    },
    {
        "full_text": "Thought I'd find the history of design thinking a tad boring but of course, it's still interesting af.\n\nBecause it's design.\n\nAnd I'm me (duh).\n\nWay too tired though. Zzz. xD\n\n82/100 Days of UX",
        "created_at": "Wed Mar 23 15:08:43 +0000 2022",
        "id": "1506649145251340289",
        "media": false
    },
    {
        "full_text": "STEM-types tend to systematically explore possibilities then determine fundamental rules for an optimal solution (problem-focused problem-solvers); designers prototype lots then test to see what fits the rules - 'satisficing' (solution-focused problem-solvers)\n\n83/100 Days of UX",
        "created_at": "Thu Mar 24 12:25:18 +0000 2022",
        "id": "1506970409274867715",
        "media": false
    },
    {
        "full_text": "There are soooooo many design thinking frameworks; I'm starting to wonder what the pros and cons are, really.\n\nMaybe time to write an article :3\n\n84/100 Days of UX",
        "created_at": "Fri Mar 25 12:54:02 +0000 2022",
        "id": "1507340030410629122",
        "media": false
    },
    {
        "full_text": "Today's takeaway - p. much just focus on the foundations behind design thinking frameworks instead of analysing them to pick a fav. They can be interpreted differently.\n\nStill gonna write that article though 😆\n\n85/100 Days of UX",
        "created_at": "Sat Mar 26 13:08:08 +0000 2022",
        "id": "1507705963553656835",
        "media": false
    },
    {
        "full_text": "'The problems that exist in the world today cannot be solved by the level of thinking that created them.' \n- Einstein, apparently.\n\nOne would have to have incredible self-awareness to realise this and then transcend.\n\nOr we can help each other. 😉\n\n86/100 Days of UX",
        "created_at": "Sun Mar 27 12:36:17 +0000 2022",
        "id": "1508060338163367946",
        "media": false
    },
    {
        "full_text": "'A wicked problem is a social or cultural problem that’s difficult or impossible to solve because of its complex and interconnected nature.'\n\nFinally doing a deeper dive on these. Excited! :D\n\n87/100 Days of UX",
        "created_at": "Mon Mar 28 15:02:05 +0000 2022",
        "id": "1508459418484375555",
        "media": false
    },
    {
        "full_text": "Soooo it's pretty much a combination of systems thinking and agile methodology in the context of design thinking that can be used to address wicked problems.\n\nOur favourite. 💀\n\n88/100 Days of UX",
        "created_at": "Tue Mar 29 13:57:11 +0000 2022",
        "id": "1508805473268813832",
        "media": false
    },
    {
        "full_text": "'You need to gain an understanding of their environment, as well as their roles and interactions within it if you want to truly empathize with them.'\n\nSeeing things through other people's eyes can take a bit more effort than some people are used to. :3\n\n89/100 Days of UX",
        "created_at": "Wed Mar 30 15:10:12 +0000 2022",
        "id": "1509186233632956417",
        "media": false
    },
    {
        "full_text": "'It’s not enough that the technology exists (i.e. feasibility is present) and that profits or business benefits may be derived (i.e. it is viable). Users need to feel a sense of *desirability* towards a solution.'\n\nThat sweet spot is achieved with empathy.\n\n90/100 Days of UX",
        "created_at": "Thu Mar 31 12:48:22 +0000 2022",
        "id": "1509512930727198721",
        "media": false
    },
    {
        "full_text": "'Empathy is also the only way to thoroughly understand what people mean, rather than just absorb what they say.'\n\nBeen reflecting fairly heavily on my ability to read between the lines. Need something far more nuanced than the usual advice to improve tbh.\n\n91/100 Days of UX",
        "created_at": "Fri Apr 01 11:25:09 +0000 2022",
        "id": "1509854374763560968",
        "media": false
    },
    {
        "full_text": "'The aim of empathic design studies is not to seek solutions for recognized problems, but rather to look for design opportunities as well as develop a holistic understanding of the users.'\n- Tuuli Mattelmäki\n\n92/100 Days of UX",
        "created_at": "Sat Apr 02 11:28:26 +0000 2022",
        "id": "1510217589653655567",
        "media": false
    },
    {
        "full_text": "People who wonder whether the glass is half empty or half full miss the point. The glass is refillable.\n- Simon Sinek, apparently.\n\nDidn't *need* add to the proverbial phrase to point out perspective can be everything, but it still resonated with me.\n\n93/100 Days of UX",
        "created_at": "Sun Apr 03 01:04:04 +0000 2022",
        "id": "1510422849718460417",
        "media": false
    },
    {
        "full_text": "Starting to wonder what the effect of person-positivity bias has on software - to what degree. I see Twitter commentary about personas and 'what we actually do in industry' but without references to the bias and addressing underlying issues 🙃\n\n94/100 Days of UX",
        "created_at": "Mon Apr 04 04:31:51 +0000 2022",
        "id": "1510837528093667329",
        "media": false
    },
    {
        "full_text": "That was from Don Norman in Rethinking Design Thinking.\n\n95/100 Days of UX",
        "created_at": "Mon Apr 04 19:44:56 +0000 2022",
        "id": "1511067312061034498",
        "media": false
    },
    {
        "full_text": "Not once have I heard that paper prototypes aren't particularly useful when it comes to familiar user interface patterns and skipping to wireframes or something more hi-fi is fine.\n\nI did that anyway but it's nice to see it in writing 💀\n\n96/100 Days of UX",
        "created_at": "Tue Apr 05 22:45:14 +0000 2022",
        "id": "1511475075182391297",
        "media": false
    },
    {
        "full_text": "Heuristics are great but they're not a substitute for usability testing 🙅‍♀️ Don't rely solely on them, especially if you've got a 'good' design on your hands.\n\nAlso, finished my last course for this 100 days sesh 🥳🥳\n\n97/100 Days of UX",
        "created_at": "Wed Apr 06 23:24:45 +0000 2022",
        "id": "1511847406421561344",
        "media": false
    },
    {
        "full_text": "I was gonna read a bunch of articles but two were thought-provoking enough to leave me here just sitting and thinking xD\n\n1. I'll create transcripts of future interviews and focus on the user more\n\n2. Is approaching design with implicit kindness enough? 🙃\n\n98/100 Days of UX",
        "created_at": "Thu Apr 07 20:13:46 +0000 2022",
        "id": "1512161732516802560",
        "media": false
    },
    {
        "full_text": "The unit bias behind infinite scroll reminds me of the effect of digital currency on some people, who have less control and tracking power than when handling physical money. It's so easy to get lost.\n\nAnd then we go and combine the two.💀\n\n99/100 Days of UX",
        "created_at": "Fri Apr 08 19:41:24 +0000 2022",
        "id": "1512515974142267394",
        "media": false
    },
    {
        "full_text": "Honestly, my mind is blown just by the fact that musical scores can be visually designed in such a manner, let alone such a beautiful one.\n\nAn enlightening and appropriate segue (heh) to our next challenge. Coming soon™! 😉 \n\nhttps://t.co/4uAqG8E2Vn\n\n100/100 Days of UX",
        "created_at": "Sat Apr 09 22:42:50 +0000 2022",
        "id": "1512924022186848258",
        "media": false
    },
    {
        "full_text": "I completed five courses in my 100 Days of UX Challenge; three from Udemy! Shocker. 🤣\n\nI did an acting course; I learnt a lot about embodying emotion, so I celebrate that too.\n\nThis was as successful as it could've been on low energy mode. \n\nInfo tomorrow about the next 100 set! https://t.co/MA3WEmHHQ6",
        "created_at": "Fri Apr 15 21:16:00 +0000 2022",
        "id": "1515076496888582156",
        "media": "https://t.co/MA3WEmHHQ6"
    }
]