[
    {
        "full_text": "Round 9 - \n\n0/100 Days of Health: In which Tabs becomes a machine.\n\nI planned a whole thread but ended up writing about 1k words' worth of personal notes xD. My system goals include addressing:\n\n🛌 Sleep\n🍲 Diet\n💪 Exercise\n🧠 Emotions\n\nGood luck to everyone on their 100 Day…",
        "created_at": "Thu Aug 31 14:17:48 +0000 2023",
        "id": "1697252349247738245",
        "media": false
    },
    {
        "full_text": "I started this whole challenge with the most miserable day 🤣 I hardly did anything, ate like crap, and I'm sleeping late.\n\nAt least it's earlier than yesterday and I can only go up from here.\n\nProbably. 💀\n\n1/100 Days of Health",
        "created_at": "Fri Sep 01 12:20:02 +0000 2023",
        "id": "1697585100475760900",
        "media": false
    },
    {
        "full_text": "I ate actual food today - though not the healthiest - and I'll be asleep much earlier as my mood has improved.\n\nAlso did some kettlebell swings. Ay. :D Baby steps.\n\nI do have a headache but I'll be unconscious soon 😇 Yes, I drank water. \n\n2/100 Days of Health",
        "created_at": "Sat Sep 02 11:59:56 +0000 2023",
        "id": "1697942429914292340",
        "media": false
    },
    {
        "full_text": "My cat likes to lick kettlebells, and didn't want to let me sleep.\n\nI wanted to start the Insanity program, but after a persistent headache and injuries I resigned myself to rest.\n\nI ate the last chocolate bar in the house. There won't be any more.\n\n3/100 Days of Health",
        "created_at": "Sun Sep 03 13:22:27 +0000 2023",
        "id": "1698325584848552131",
        "media": false
    },
    {
        "full_text": "Still healing, so I digested some Insanity guides. My goal is 1400 calories a day; I'm a potato 💀\n\nI won't be as strict as I've been about sugar before; just more intentional about it.\n\nI'll do the Sanity Check for about a week before I begin the program.\n\n4/100 Days of Health",
        "created_at": "Mon Sep 04 11:37:31 +0000 2023",
        "id": "1698661565074157929",
        "media": false
    },
    {
        "full_text": "I'd slept poorly (but earlier!); I spent the afternoon asleep to combat exhaustion. \n\nI'd started cooking but started late. I canned it in favour of something less healthy, but quick. Less stress to make stream.\n\nI need to prep meals I can heat from frozen.\n\n5/100 Days of Health",
        "created_at": "Tue Sep 05 11:21:04 +0000 2023",
        "id": "1699019813593747941",
        "media": false
    },
    {
        "full_text": "I woke up twice, but I've been awake since before 6 AM. My sleep schedule is shifting! So excited 🤣\n\nBased on my amount of walking today, I'll attempt a Sanity Check tomorrow.\n\nI ate unhealthily but I damn well enjoyed that kronut and banana milkshake 😆\n\n6/100 Days of Health",
        "created_at": "Wed Sep 06 11:56:16 +0000 2023",
        "id": "1699391059519017368",
        "media": false
    },
    {
        "full_text": "I got so caught up with work I kept postponing the Sanity Check 😭\n\nI reached 130 kettlebell swings at 8kgs, 'cause WEEEAK 🤣 Just so I did... Something.\n\nTomorrow I won't work for 12 hours straight; I'll make the time.\n\nALSO - ALSO - NO NAPS TODAYYY!\n\n7/100 Days of Health",
        "created_at": "Thu Sep 07 11:26:14 +0000 2023",
        "id": "1699745889391456385",
        "media": false
    },
    {
        "full_text": "Dude, I died during the WARM UP for the Sanity Check workout today 💀😆\n\nI'll probably be doing that for a full week before I can even begin the actual program 🤣\n\nWhatever. I got this.\n\nEventually.\n\n8/100 Days of Health",
        "created_at": "Fri Sep 08 11:29:18 +0000 2023",
        "id": "1700109049076052184",
        "media": false
    },
    {
        "full_text": "Low AF willpower today; managed to not nap, and get into bed by 21:30. Only 50 kettlebell swings xD\n\nI stuck to the sleep rule; good enough! 😩 \n\n9/100 Days of Health",
        "created_at": "Sat Sep 09 11:33:09 +0000 2023",
        "id": "1700472405167387061",
        "media": false
    },
    {
        "full_text": "Besides doing f-all: I didn't nap, I started consuming more protein, and drank more water than usual.\n\nTomorrow it's back to the brink of Insanity :D\n\n10/100 Days of Health",
        "created_at": "Sun Sep 10 12:27:29 +0000 2023",
        "id": "1700848465478303830",
        "media": false
    },
    {
        "full_text": "The Sanity Check warm-up + workout is 26 mins. I lasted for 17 before my body felt it was going to stop moving 🤣\n\nI tried to do the exercises properly, so it hit harder.\n\nI'll be repeating the workout until I can finish it before I start Insanity.\n\n11/100 Days of Health",
        "created_at": "Mon Sep 11 12:11:41 +0000 2023",
        "id": "1701206878523703646",
        "media": false
    },
    {
        "full_text": "I stuck to my low stress rules; I'd clumped my meetings + errands together, and did my workout at 8 AM.\n\nI was ready so early there was no tension in my morning. I much prefer this routine for days where things interfere with extended brain work time. \n\n12/100 Days of Health",
        "created_at": "Tue Sep 12 11:17:32 +0000 2023",
        "id": "1701555638642565179",
        "media": false
    },
    {
        "full_text": "My body is sore. DOMS? Maybe.\n\nI was coming up with all sorts of excuses to cave early. I remembered a guildie doing the 100D Challenges. F it; I'm stubborn, and I'll fight myself.\n\nAlthough half-dead, I finished the Sanity Check for the first time.\n\n13/100 Days of Health",
        "created_at": "Wed Sep 13 02:34:56 +0000 2023",
        "id": "1701786510750777532",
        "media": false
    },
    {
        "full_text": "Rest day!\n\nAt least I'm getting better at listening to my body.\n\nTomorrow's got meetings, and I Leave The House, so I have a bunch of rules in effect. We'll see how it goes.\n\n14/100 Days of Health",
        "created_at": "Thu Sep 14 12:45:45 +0000 2023",
        "id": "1702302614090870840",
        "media": false
    },
    {
        "full_text": "Today went as planned, except for work 🤣\n\nThe Sanity Check is getting easier to finish; I'll need to increase effort. My lower back hurts (in general), which I'll sort with kettlebells.\n\nThe freakin' oat face milk's FINALLY finished. Tomorrow: retinol! :D\n\n15/100 Days of Health",
        "created_at": "Fri Sep 15 12:01:18 +0000 2023",
        "id": "1702653819031879703",
        "media": false
    },
    {
        "full_text": "Did nothing much today except work.\n\nGoing to sleep early 🫡\n\nnn.\n\n16/100 Days of Health",
        "created_at": "Sat Sep 16 10:51:22 +0000 2023",
        "id": "1702998606977089861",
        "media": false
    },
    {
        "full_text": "I pulled a muscle between my shoulder blades and neck; probs slept badly. \n\nI spent three hours walking with my camera though - so I at least got some exercise even if I couldn't push it.\n\nI bought fudge; 'if my cat can have treats why can't I 😇' 🤣\n\n17/100 Days of Health",
        "created_at": "Sun Sep 17 13:52:26 +0000 2023",
        "id": "1703406560796705004",
        "media": false
    },
    {
        "full_text": "Sanity Check. Relaxing massage. 50 kettlebell swings. Sugar.\n\nGreat day for exercise, as this is the first time I stopped taking extended breaks for the Sanity Check, and piled on the bells later in the day... Food, not so much 😆\n\n18/100 Days of Health",
        "created_at": "Mon Sep 18 10:48:26 +0000 2023",
        "id": "1703722642988212583",
        "media": false
    },
    {
        "full_text": "Instead of pure exhaustion I felt muscle burn while out of breath. Less back pain today, too! I think it's the bells.\n\nI did kettlebells before stream; bad idea. My arms were trembling and I don't have enough desk space to rest them comfortably 😆\n\n19/100 Days of Health",
        "created_at": "Tue Sep 19 11:40:32 +0000 2023",
        "id": "1704098142088843696",
        "media": false
    },
    {
        "full_text": "I need to do my workouts before noon, or I'm just not gonna wanna bother💀\n\n50 kettlebells. I'm dying for sugary things and eating healthily is efforrrrt😆\n\n20/100 Days of Health",
        "created_at": "Wed Sep 20 11:48:16 +0000 2023",
        "id": "1704462474756624596",
        "media": false
    },
    {
        "full_text": "Didn't want to work out. Did it late 😩\n\nMy lungs aren't dying to keep up anymore; the rest of my body however, different story 😆 Which is good; I put in enough effort.\n\n21/100 Days of Health",
        "created_at": "Thu Sep 21 11:43:29 +0000 2023",
        "id": "1704823659549139208",
        "media": false
    },
    {
        "full_text": "Pulled some neck/shoulder muscle badly enough I skipped the workouts today.\n\nSleeping early though let's gooo 🫡\n\n22/100 Days of Health",
        "created_at": "Fri Sep 22 10:47:46 +0000 2023",
        "id": "1705172027395789227",
        "media": false
    },
    {
        "full_text": "Felt a stab of pain in my thigh a few times when I was walking ever-so-gently, so I skipped the workouts today. Hopefully I'll be okay to do them tomorrow.\n\nnn! :D\n\n23/100 Days of Health",
        "created_at": "Sat Sep 23 11:18:33 +0000 2023",
        "id": "1705542162468032664",
        "media": false
    },
    {
        "full_text": "The pain is still there?? Idk what it is??? Should probs figure that out xD\n\nIt turns out I can enjoy cinnamon + milk instead of hot chocolate. I kinda wanna make horchata without sugar but dunno if that'll taste any good.\n\n24/100 Days of Health",
        "created_at": "Sun Sep 24 12:11:54 +0000 2023",
        "id": "1705917974232907820",
        "media": false
    },
    {
        "full_text": "My willpower today was spent on not caving into sugar and stopping work early enough to get some sleep.\n\nBleh.\n\n25/100 Days of Health",
        "created_at": "Mon Sep 25 12:04:30 +0000 2023",
        "id": "1706278502721581200",
        "media": false
    },
    {
        "full_text": "More resting and stressing 😆 Gonna need a workout soon to help reduce the cortisol. \n\nAte so much chicken today tomorrow will need to be veggie-heavy.\n\n 26/100 Days of Health",
        "created_at": "Tue Sep 26 20:08:28 +0000 2023",
        "id": "1706762683570332042",
        "media": false
    },
    {
        "full_text": "Woke up early, worked, napped, woke up late, morning was gone. Went to a cafe impromptu; I'd decided to be nice today. No workout. Lots of sugar 😅\n\nI took work with me. No lamenting 'wasted time' in transport. Low stress win.\n\n27/100 Days of Health",
        "created_at": "Wed Sep 27 23:21:18 +0000 2023",
        "id": "1707173600728625378",
        "media": false
    },
    {
        "full_text": "I will have you know there is chocolate in the house and I did not have any.\n\nNo workout today, but I think I'll have the energy for it tomorrow. No promises. 😘\n\n28/100 Days of Health",
        "created_at": "Thu Sep 28 10:56:42 +0000 2023",
        "id": "1707348600425218064",
        "media": false
    },
    {
        "full_text": "Persevered and got the initial version sorted. It took me less than a week to convert that entire project over from React to Svelte.\n\nSugar bomb tomorrow as a treat; however, the workouts must also resume.\n\nNight!\n\n29/100 Days of Health",
        "created_at": "Fri Sep 29 11:37:56 +0000 2023",
        "id": "1707721366282359028",
        "media": false
    },
    {
        "full_text": "I told myself I can have boba/bubble tea when I reach major milestones; I'd have to make it myself. \n\nngl I just like the tapioca pearls and they can be bland af. I'll probably ditch the sugar and have the pearls in cinnamon milk.\n\n30/100 Days of Health https://t.co/UONqFeRHzp",
        "created_at": "Sat Sep 30 12:38:06 +0000 2023",
        "id": "1708098896063602771",
        "media": "https://t.co/UONqFeRHzp"
    },
    {
        "full_text": "Caved into sugar.  Reduced tasks on my plate :3 Almost there! Gonna do my packing tomorrow so I don't do it last minute.\n\nDaylight savings is messing with my brain :')\n\n31/100 Days of Health",
        "created_at": "Sun Oct 01 12:39:06 +0000 2023",
        "id": "1708461533901287882",
        "media": false
    },
    {
        "full_text": "Had all intentions of doing a good workout today; ended up with a headache in the afternoon and just tapping out until tomorrow. I'll just rest at a reasonable time.\n\nAlso bought SPF moisturiser recently so I'll start the retinol after PAX.\n\n32/100 Days of Health",
        "created_at": "Mon Oct 02 10:39:34 +0000 2023",
        "id": "1708793841694978089",
        "media": false
    },
    {
        "full_text": "Sleeping way too late. Should have done more packing earlier. But it's okay, I'll function just fine. Hopefully I'll have enough time to do some cleaning in the morning, that's all xD\n\n33/100 Days of Health",
        "created_at": "Tue Oct 03 15:12:38 +0000 2023",
        "id": "1709224951658733702",
        "media": false
    },
    {
        "full_text": "0 workout but got to sleep at a reasonable time despite the travelling.\n\nStarting to feel like I rather put whatever effort and drive I have for the day entirely into my working out instead of my work.\n\nI may be witnessing my own attitude shift.\n\n34/100 Days of Health",
        "created_at": "Thu Oct 05 03:47:34 +0000 2023",
        "id": "1709777323753615862",
        "media": false
    },
    {
        "full_text": "Did the Sanity Check because it's been a week or so; found I could still put in more effort. I could start the Insanity Program but I'll die doing it.\n\nMonday let's go 💀\n\n35/100 Days of Health",
        "created_at": "Fri Oct 06 09:16:54 +0000 2023",
        "id": "1710222589132698007",
        "media": false
    },
    {
        "full_text": "Up from 6 in the morning and out at PAX Aus the entire day. Tons of walking though; I speed along instead of amble so my legs are still sore xD\n\nSteamed everything for the three days early and did as much prep as possible 🔥\n\n36/100 Days of Health",
        "created_at": "Fri Oct 06 22:54:12 +0000 2023",
        "id": "1710428268602827255",
        "media": false
    },
    {
        "full_text": "Another long day at PAX; in bed an hour earlier though. Slayy 💀\n\nNgl I enjoyed some sugar, buuuut there's so much walking around I'll have covered it fr\n\n37/100 Days of Health https://t.co/DPTWZdxqR8",
        "created_at": "Sat Oct 07 11:12:12 +0000 2023",
        "id": "1710613994879488406",
        "media": "https://t.co/DPTWZdxqR8"
    },
    {
        "full_text": "In bed early today, but there's too much house noise going on for me to sleep 😬\n\nLast day of PAX, so lots of walking and plenty of sugar to compensate 🤣. Still working on my Yennefer (Witcher 3) cosplay.\n\n38/100 Days of Health https://t.co/BIbVdNqssE",
        "created_at": "Sun Oct 08 11:57:20 +0000 2023",
        "id": "1710987738588279269",
        "media": "https://t.co/BIbVdNqssE"
    },
    {
        "full_text": "Spent most of the day on my feet, so no workout. Pulled some lower back muscle somehow; I have no idea, so don't ask xD\n\nIn bed at a good enough time considering recent events. Good enough.\n\n39/100 Days of Health",
        "created_at": "Mon Oct 09 11:41:32 +0000 2023",
        "id": "1711346150404714835",
        "media": false
    },
    {
        "full_text": "Packed early enough; no last minute things tomorrow morning.\n\nNvm - I just forgot one thing I needed to pack. 🤣\n\nNo workout today due to the pulled muscles yesterday.\n\n40/100 Days of Health",
        "created_at": "Tue Oct 10 12:17:20 +0000 2023",
        "id": "1711717549614969210",
        "media": false
    },
    {
        "full_text": "Sick today (ty harbingers of colds), so just cleaned and rested. All of my PAX stuff is already washed; no lingering laundry for a week! 😆\n\nClimbing into bed with fresh, clean sheets after a shower is the best way to end the day ✨️\n\n41/100 Days of Health",
        "created_at": "Wed Oct 11 11:54:45 +0000 2023",
        "id": "1712074255368851800",
        "media": false
    },
    {
        "full_text": "Managed some chores and work. That's about it, really.\n\nIll enough I was still mostly holed up in my room and the cat was NOT pleased xD\n\n42/100 Days of Health",
        "created_at": "Fri Oct 13 13:06:49 +0000 2023",
        "id": "1712817166847013030",
        "media": false
    },
    {
        "full_text": "Still bleh. Did admin and paperwork the entire day in bed 😩 Got some ice cream and chocolate milk as a reward.\n\nDidn't think sickness would screw with bedtime but there ya go.\n\n43/100 Days of Health",
        "created_at": "Fri Oct 13 13:07:00 +0000 2023",
        "id": "1712817211214385585",
        "media": false
    },
    {
        "full_text": "Still p. gross but wore my mask, voted, and got some fresh air. Managed some admin.\n\nnn!\n\n44/100 Days of Health",
        "created_at": "Sat Oct 14 12:11:03 +0000 2023",
        "id": "1713165520076407170",
        "media": false
    },
    {
        "full_text": "New phone who dis\n\nStill out of it. Still productive: gaming, a Whale Fall core gameplay loop meeting, acquired my new phone, and started an assignment.\n\n45/100 Days of Health https://t.co/WwizCZxUP8",
        "created_at": "Sun Oct 15 12:54:59 +0000 2023",
        "id": "1713538962919485570",
        "media": "https://t.co/WwizCZxUP8"
    },
    {
        "full_text": "WOO, nearly recovered.\n\nI've returned to running my days on full steam but not feeling stressed. Something shifted me into a better headspace; unsure if it was PAX, changing projects, or re-initiating a positive feedback loop.\n\n46/100 Days of Health",
        "created_at": "Mon Oct 16 11:43:25 +0000 2023",
        "id": "1713883338753327178",
        "media": false
    },
    {
        "full_text": "Had ice cream, aaaaaand... That's about all that was noteworthy about today.\n\nFocussed on getting work off my plate. I feel like I'm slowing down to some degree.\n\n47/100 Days of Health",
        "created_at": "Wed Oct 18 10:55:32 +0000 2023",
        "id": "1714596068179276105",
        "media": false
    },
    {
        "full_text": "I've not quite recovered; said fk it and did kettlebells xD Felt good about doing *something*.\n\nAll despite my low, shitty af mood.\n\nI have a knack of deciding things will be good before shit hits the fan😆\n\nIt will be a good week; because I said so.\n\n48/100 Days of Health",
        "created_at": "Wed Oct 18 10:59:32 +0000 2023",
        "id": "1714597074040443193",
        "media": false
    },
    {
        "full_text": "I feel so behind with my workouts; totally not where I wanted to be. Oh well~\n\nContinued the minimum of 50 kb swings. Arms are feeling it after two days 😆 \n\nTackled work I dislike. Worked out. Streamed. In bed before 21:30. \n\nGood day. Hell yeah.\n\n49/100 Days of Health",
        "created_at": "Thu Oct 19 10:13:40 +0000 2023",
        "id": "1714947919034642676",
        "media": false
    },
    {
        "full_text": "60 kb swings. Yeeted more work off my plate *and* did a f-ton of laundry. Even gamed for an hour.\n\nProductivity win even if my workout was eh.\n\n50/100 Days of Health",
        "created_at": "Fri Oct 20 11:23:43 +0000 2023",
        "id": "1715327935476080811",
        "media": false
    },
    {
        "full_text": "Slept poorly, so I slept almost through the entire morning and trudged through half of the work I wanted to finish today. Meh. I'll see if I can play catch-up tomorrow.\n\n80 kb swings. P. sure I could do more, so I may start splitting it into sets.\n\n51/100 Days of Health",
        "created_at": "Sat Oct 21 11:59:22 +0000 2023",
        "id": "1715699294311940392",
        "media": false
    },
    {
        "full_text": "100 kb swings; two sets of 50.\n\nSlept late because I was having fun coding, for once. There's definitely a reason I enjoyed graphics and design when it accompanies code 🤣\n\nC programming feels like a series of puzzles I'd sometimes do for fun. Sometimes.\n\n52/100 Days of Health",
        "created_at": "Mon Oct 23 10:27:53 +0000 2023",
        "id": "1716401047881797909",
        "media": false
    },
    {
        "full_text": "Endured a meeting, did more CS50 and C programming, and just 50 kb swings. My body is tired 😩\n\nThat's good, though. Git stronger, noob. 🤣\n\nI had so much sugar today that after tomorrow I'm gonna push to do extra workouts.\n\n53/100 Days of Health",
        "created_at": "Mon Oct 23 10:30:50 +0000 2023",
        "id": "1716401791376794051",
        "media": false
    },
    {
        "full_text": "Back to 100 kbs. Should I be increasing workouts until I feel sore the day after, and then take a break, or just do them every day and increase slowly?\n\n54/100 Days of Health",
        "created_at": "Wed Oct 25 01:53:04 +0000 2023",
        "id": "1716996265144447125",
        "media": false
    },
    {
        "full_text": "Just 50 kb swings. And an ice cream sandwich.\n\n💀\n\nWaking up to my sunrise alarm though is great.\n\n55/100 Days of Health",
        "created_at": "Wed Oct 25 11:36:57 +0000 2023",
        "id": "1717143203940589603",
        "media": false
    },
    {
        "full_text": "Honestly, somewhat sick today. Mostly resting and coding.\n\nI will be asleep before midnight! nn :D\n\n56/100 Days of Health",
        "created_at": "Thu Oct 26 11:51:19 +0000 2023",
        "id": "1717509206503534858",
        "media": false
    },
    {
        "full_text": "Didn't do the sugar thing today. Slept at an okay time. Sick still, so mostly fatigued.\n\nSo-so.\n\n57/100 Days of Health",
        "created_at": "Sat Oct 28 13:14:33 +0000 2023",
        "id": "1718254928978940060",
        "media": false
    },
    {
        "full_text": "Sacrificed sleep tonight to get something off my plate. I wouldn't normally do this; I was going to get frustrated if I didn't finish it.\n\n00:15; signing out~\n\n58/100 Days of Health",
        "created_at": "Sat Oct 28 13:15:45 +0000 2023",
        "id": "1718255233032495269",
        "media": false
    },
    {
        "full_text": "Sugar bombs everywhere but this time I made most of mine 🤣 I quite enjoyed the salted caramel apples for the Halloween Hangout we were hosting.\n\nSlept late-ish but took all the decorations down so there's nothing left for the next day.\n\n59/100 Days of Health https://t.co/gEswzYhKWr",
        "created_at": "Thu Nov 02 11:31:50 +0000 2023",
        "id": "1720041017519587587",
        "media": "https://t.co/gEswzYhKWr"
    },
    {
        "full_text": "Spent most of the day on my feet cleaning stuff around the house so I said fk it to doing a workout. I was tired by the end of it regardless. xD\n\n60/100 Days of Health",
        "created_at": "Thu Nov 02 11:37:48 +0000 2023",
        "id": "1720042522259734879",
        "media": false
    },
    {
        "full_text": "Travel today. Slept poorly because... I think not finishing the packing the night before left me a little stressed. It woke up so early I had plenty of time xD\n\nNapped on the bus and went to bed early enough.\n\n61/100 Days of Health",
        "created_at": "Thu Nov 02 11:42:03 +0000 2023",
        "id": "1720043590465015876",
        "media": false
    },
    {
        "full_text": "I climbed a mast today. After failing at the overhang once I couldn't muster the energy to try again xD\n\nTore some skin unfurling them too &gt;_&gt;\n\n62/100 Days of Health https://t.co/G1PL5rTyGM",
        "created_at": "Thu Nov 02 11:59:57 +0000 2023",
        "id": "1720048093180395546",
        "media": "https://t.co/G1PL5rTyGM"
    },
    {
        "full_text": "Did about 11 km of walking and a treetops obstacle course activity thing.\n\nMy arms and legs are deeeeead but that was fun!\n\n63/100 Days of Health https://t.co/DV0lPVvY0v",
        "created_at": "Thu Nov 02 12:04:03 +0000 2023",
        "id": "1720049127835443385",
        "media": "https://t.co/DV0lPVvY0v"
    },
    {
        "full_text": "Frantically walked to Sydney Opera House for a show (freaking amazing) and left the exercise at that because yesterday's antics left me deaaaad. My sweaty forehead should be enough. 😆\n\n64/100 Days of Health https://t.co/kaWnRaca2X",
        "created_at": "Fri Nov 03 13:16:54 +0000 2023",
        "id": "1720429846130778609",
        "media": "https://t.co/kaWnRaca2X"
    },
    {
        "full_text": "Had a crappy day so writing this off as a rest day - too bad, so sad 😇\n\nApparently I will not be getting decent sleep until I'm back in my own bed whelp\n\n65/100 Days of Health",
        "created_at": "Sun Nov 05 03:52:40 +0000 2023",
        "id": "1721012630851293529",
        "media": false
    },
    {
        "full_text": "Gym today: 10.7km on the bike (30ish mins of some fat burn program) and some sets of lat pull-up and seated row exercises until I felt tired.\n\nI think I'd enjoy a home gym setup. Future me: take note.\n\n66/100 Days of Health",
        "created_at": "Sun Nov 05 03:56:12 +0000 2023",
        "id": "1721013517405569486",
        "media": false
    },
    {
        "full_text": "A fair bit of today was spent on my feet. Walked about 8km. Napped because sleeping issues.\n\nPacked p. early and did everything I wanted so... Good enough.\n\nLooking forward to my own bed tomorrow. ^^\n\n67/100 Days of Health",
        "created_at": "Mon Nov 06 12:22:22 +0000 2023",
        "id": "1721503289488064976",
        "media": false
    },
    {
        "full_text": "Walked around Sydney doing a scavenger hunt over a few hours, so gonna count that as my exercise.\n\nAlmost got sunburnt. My hood didn't cover my nose 😆\n\n68/100 Days of Health https://t.co/wbmAKm2kM0",
        "created_at": "Fri Nov 10 13:09:08 +0000 2023",
        "id": "1722964608254882009",
        "media": "https://t.co/wbmAKm2kM0"
    },
    {
        "full_text": "Slept at a decent time and that was about all I managed.\n\nAh well~\n\n69 (nice)/100 Days of Health",
        "created_at": "Fri Nov 10 13:11:38 +0000 2023",
        "id": "1722965238218182951",
        "media": false
    },
    {
        "full_text": "Dentist! Haven't been in like 10 years (oops); it turns out I needed a filling. Ended up hanging around for the next appointment to avoid returning; 20 mins with no anaesthesia. P. good!\n\nMy 31-year streak has been broken 😭\n\nAlso: 120 kettlebell swings.\n\n70/100 Days of Health",
        "created_at": "Fri Nov 10 13:15:55 +0000 2023",
        "id": "1722966317618385003",
        "media": false
    },
    {
        "full_text": "120 kb swings; did them + got ready early. I feel like I accomplished little, but hey, I reduced general stress.\n\nAttended a candle-lit concert playing Studio Ghibli tributes. I thoroughly enjoyed it and underestimated the good it did for my energy.\n\n71/100 Days of Health https://t.co/04hZwh5sGy",
        "created_at": "Fri Nov 10 13:23:02 +0000 2023",
        "id": "1722968108636258494",
        "media": "https://t.co/04hZwh5sGy"
    },
    {
        "full_text": "Emotional day, so I did my workout and work late. Sleeping late too. w/e. I'll sleep a bit better knowing they're done.\n\n72/100 Days of Health",
        "created_at": "Sat Nov 11 13:25:43 +0000 2023",
        "id": "1723331168702279811",
        "media": false
    },
    {
        "full_text": "120 kettlebells. Woo.\n\nSo tired of existing 😩 I'll be fine dw.\n\nBeing human is just so exhausting sometimes. Emotional energy is at 1/10 today.\n\n73/100 Days of Health",
        "created_at": "Sun Nov 12 09:58:52 +0000 2023",
        "id": "1723641504072454404",
        "media": false
    },
    {
        "full_text": "3 AM. Took a rest day and pretty much just spent the afternoon and evening doing karaoke.\n\nI feel a bit better.\n\n74/100 Days of Health https://t.co/BiZuAwh88e",
        "created_at": "Mon Nov 13 16:10:20 +0000 2023",
        "id": "1724097372287041543",
        "media": "https://t.co/BiZuAwh88e"
    },
    {
        "full_text": "Still solid meh energy.\n\nWent to a spa and got a 1.5h relaxing massage, and some aromatherapy facial rejuvenation thing.\n\nIt's good to learn that helps considerably in addition to spending a day in a tub.\n\n75/100 Days of Health",
        "created_at": "Thu Nov 16 13:16:41 +0000 2023",
        "id": "1725140837904838890",
        "media": false
    },
    {
        "full_text": "Spent half the day asleep, did what errands I could, and played Stray.\n\nSephi came to watch, but then turned around to watch us instead 🤣 Apparently humans are more interesting than CGI cats to him.\n\n76/100 Days of Health https://t.co/TXP2KFRkXn",
        "created_at": "Thu Nov 16 13:22:30 +0000 2023",
        "id": "1725142300056314279",
        "media": "https://t.co/TXP2KFRkXn"
    },
    {
        "full_text": "Didn't want to go another day without a workout, so 120 kettlebell swings at the end of the day it was. I'd have had another thing to be frustrated with xD\n\nDid have some nice ice cream too - pistachio kulfi.\n\n77/100 Days of Health https://t.co/rk4lBCPx6F",
        "created_at": "Thu Nov 16 13:24:56 +0000 2023",
        "id": "1725142911069909338",
        "media": "https://t.co/rk4lBCPx6F"
    },
    {
        "full_text": "Should have done my workout this morning. Got a COVID booster in one arm and flu shot in the other; it's too sore for me to lift much xD\n\nPleased with my manoeuvering to get the shots out of the way today though. I CALLED people 🤣\n\nAlso: boat trip 😍\n\n78/100 Days of Health https://t.co/KTQQeB14NI",
        "created_at": "Fri Nov 17 10:59:12 +0000 2023",
        "id": "1725468626000732165",
        "media": "https://t.co/KTQQeB14NI"
    },
    {
        "full_text": "My body thinks it's sick; I must endure fatigue. My arms HURT and sleeping was difficult. No workouts today. Yay. =_=\n\n79/100 Days of Health",
        "created_at": "Tue Nov 28 21:45:06 +0000 2023",
        "id": "1729617437073576176",
        "media": false
    },
    {
        "full_text": "Much of the same as yesterday; still fighting off the non-sickness. Slightly better though. Saw one friend off and met another for dindin. It feels good to socialise for a bit before I leave.\n\n80/100 Days of Health",
        "created_at": "Tue Nov 28 22:46:00 +0000 2023",
        "id": "1729632762389537011",
        "media": false
    },
    {
        "full_text": "I may have been smart by doing all the laundry and cleaning ahead of time, but I am still v. not smart in some decisions like playing Pandemic: Iberia for a few hours (first time! And we won!) instead of focusing on packing.\n\nSkipped sleeping.\n\n81/100 Days of Health",
        "created_at": "Tue Nov 28 23:48:00 +0000 2023",
        "id": "1729648365019742296",
        "media": false
    },
    {
        "full_text": "Glad I got my shots on Friday instead of Monday, otherwise I wouldn't have been able to lift my bags.\n\nNo sleeping actually worked in my favour because I slept more on my flights (18h journey total or something idk).\n\n82/100 Days of Health",
        "created_at": "Wed Nov 29 00:49:00 +0000 2023",
        "id": "1729663716336001224",
        "media": false
    },
    {
        "full_text": "Still some jet lag present, and had to nap, but have no trouble sticking to these unorganised mealtimes. Good enough.\n\n83/100 Days of Health",
        "created_at": "Wed Nov 29 01:50:00 +0000 2023",
        "id": "1729679067438309528",
        "media": false
    },
    {
        "full_text": "Failed to stay awake and caved in to a nap; had to end stream early because I'd slept poorly and was falling asleep so badly 💀 It screwed with my sleeping a bit at night, too.\n\n84/100 Days of Health",
        "created_at": "Wed Nov 29 03:51:00 +0000 2023",
        "id": "1729709518118965746",
        "media": false
    },
    {
        "full_text": "Got dumbbells from a cousin (the groom whose wedding I'm here for). I think this thing is at least 3.5kgs.\n\nI feel like a gym bro just working on my arms.\n\n85/100 Days of Health",
        "created_at": "Wed Nov 29 05:52:00 +0000 2023",
        "id": "1729739968816599429",
        "media": false
    },
    {
        "full_text": "Used my cousin's dumbbells again.\n\nWhy are they called dumbbells, anyway? I haven't seen any smartbells around.\n\nThe brogrammer life is not for me. Probably.\n\n86/100 Days of Health",
        "created_at": "Wed Nov 29 07:53:00 +0000 2023",
        "id": "1729770419509670209",
        "media": false
    },
    {
        "full_text": "Bought a 4kg kettlebell to learn one-handed exercises. My aunt lent me her exercise mat :D \n\nAlso bought back-up heels for the wedding because shoe shopping here sucks for me 😆 Digging this 'do things earlier' shtick. \n\n87/100 Days of Health",
        "created_at": "Wed Nov 29 09:55:00 +0000 2023",
        "id": "1729801121827561969",
        "media": false
    },
    {
        "full_text": "Learnt how to do a kettlebell overhead press, kettlebell row (suitcase), and one-handed swing.\n\n88/100 Days of Health",
        "created_at": "Wed Nov 29 11:55:00 +0000 2023",
        "id": "1729831320698654729",
        "media": false
    },
    {
        "full_text": "Got my grandmother's treadmill working and hopped on that for a bit. It's been helping my lower back pain as well as this mesh-backed chair + footrest.\n\nDid take a nap today though 💀 Maybe 30-40 mins.\n\n89/100 Days of Health",
        "created_at": "Wed Nov 29 12:56:00 +0000 2023",
        "id": "1729846671968752063",
        "media": false
    },
    {
        "full_text": "Trudging along with 0 routine, so not sleeping well.\n\nHowever; did a small kettlebell workout and hopped on the treadmill for 20 mins. Managed minimum work and admin.\n\nGood enough! I'm back (hello).\n\n90/100 Days of Health",
        "created_at": "Wed Nov 29 21:37:24 +0000 2023",
        "id": "1729977887741170113",
        "media": false
    },
    {
        "full_text": "Had to run around in the heat doing errands so had time p. much just for that and some work.\n\nRested in the arvo and had gelato xD\n\n91/100 Days of Health https://t.co/N1d6IFSSfH",
        "created_at": "Thu Nov 30 21:35:38 +0000 2023",
        "id": "1730339830096150878",
        "media": "https://t.co/N1d6IFSSfH"
    },
    {
        "full_text": "smol kettlebell workout.\n\nSpent today feeling meh so didn't get all the work I'd have liked done today. I'll have to finish it tomorrow and not stay up late because it's... Learning stuff. Can't do that with tired brain.\n\n92/100 Days of Health",
        "created_at": "Fri Dec 01 21:16:11 +0000 2023",
        "id": "1730697325482287163",
        "media": false
    },
    {
        "full_text": "Medium kettlebell workout.\n\nAlso did an escape room followed by lunch with the cousins. And lots of homemade chocolate cake 💀 Worked in the evening.\n\nMore content than usual today, tbh.\n\n93/100 Days of Health",
        "created_at": "Sat Dec 02 21:44:08 +0000 2023",
        "id": "1731066747623543100",
        "media": false
    },
    {
        "full_text": "Wrong things today. Koeksisters (doughnuts rolled in dessicated coconut), pies, apple/pear crumble w/ice cream, pasta, soda. Bed late.\n\nDid a short workout, but I'll have to adjust meals for a bit.\n\nMental health activity was nice: ceramic painting w/fam!\n\n94/100 Days of Health https://t.co/6xw0z6fUEj",
        "created_at": "Sun Dec 03 22:44:40 +0000 2023",
        "id": "1731444365988438166",
        "media": "https://t.co/6xw0z6fUEj"
    },
    {
        "full_text": "Late start, no workout, but productive enough. Helped the cousin move stuff out so I wasn't a complete potato.\n\n5/10 xD\n\n95/100 Days of Health",
        "created_at": "Mon Dec 04 21:28:18 +0000 2023",
        "id": "1731787536903655653",
        "media": false
    },
    {
        "full_text": "Smol kettlebell workout. No junk food today! :D I managed.\n\n96/100 Days of Health",
        "created_at": "Tue Dec 05 19:01:34 +0000 2023",
        "id": "1732112997407928822",
        "media": false
    },
    {
        "full_text": "Haven't seen my aunt in 15 years so... Did that. She made me plunge into a tide pool which was COLD and NOT MY VIBE and we quickly exited due to the bluebottle jellyfish.\n\nAnyway. I had a fkton of sugar to make up for all the walking 💀\n\n97/100 Days of Health https://t.co/g8Wv8psbbU",
        "created_at": "Wed Dec 06 20:28:57 +0000 2023",
        "id": "1732497375178924341",
        "media": "https://t.co/g8Wv8psbbU"
    },
    {
        "full_text": "Felt sore, so no workout. Ate terribly. Looking forward to controlling my food again 😆\n\nSlept through the night though.\n\n98/100 Days of Health",
        "created_at": "Thu Dec 07 20:34:17 +0000 2023",
        "id": "1732861106576671162",
        "media": false
    },
    {
        "full_text": "Just kettlebells and helping to move house stuff. So many boxes still xD\n\nSome exercise is better than none so that's a W for me. ☺️\n\n99/100 Days of Health",
        "created_at": "Sat Dec 09 07:05:31 +0000 2023",
        "id": "1733382351277732016",
        "media": false
    },
    {
        "full_text": "Well, I made it 🥳 Small kettlebell workout today followed by quite a bit of walking because... Mall shopping. 😩\n\nGeneral overview later. I might be getting sick, so it's time to just get some rest xD\n\n100/100 Days of Health",
        "created_at": "Sat Dec 09 20:24:58 +0000 2023",
        "id": "1733583537834532931",
        "media": false
    }
]